/*************************************************************************
	> File Name: UDP.h
	> Author: HJJ
	> Mail: 15847703113@163.com
	> Created Time: 2018年09月17日 星期一 09时44分16秒
 ************************************************************************/

#ifndef _UDP_H
#define _UDP_H

#include<arpa/inet.h>

struct sockaddr_in addr;

/*************************************************************************
 * 初始化ＵＤＰ的通信协议
 * 参数１：ｉｐｖ４的地址
 * 参数２：端口号
 * 返回值：成功返回套接字，失败返回－１
 * **********************************************************************/
int initUDP(char *ip,uint16_t hostshort);


/*************************************************************************
 * 通过ＵＤＰ发送数据
 * 参数１：ＵＤＰ的套接字
 * 参数２：要发送的数据
 * 参数３：数据的字节数
 * 返回值：成功返回发送的字节数，失败返回－１
 * **********************************************************************/
int write_UDP(int UDP_fd,char *data,int datalen);

#endif
