/*************************************************************************
	> File Name: nutriton_delivery_fruit.h
	> Author: HJJ
	> Mail: 15847703113@163.com
	> Created Time: 2018年10月17日 星期三 16时05分35秒
 ************************************************************************/

#ifndef _NUTRITON_DELIVERY_FRUIT_H
#define _NUTRITON_DELIVERY_FRUIT_H

/*************************************
 *初始化将传感器数据传输给云的功能
 *参数1:云的地址
 *返回值:成功返回0,
         失败返回-1.
 * **********************************/
int init_Data_Delivery_Cloud(char *cloud);


/*************************************
 *执行将传感器数据传输给云
 *参数1:云的地址
 *参数2:要传输的数据
 *返回值:成功返回0,
         失败返回-1.
 * **********************************/
int comply_Data_Delivery_Cloud(char *cloud,char *data);


/*************************************
 *
 *
 *
 *
 * **********************************/


#endif
