/*************************************************************************
	> File Name: TCP.h
	> Author: HJJ
	> Mail: 15847703113@163.com
	> Created Time: 2018年09月18日 星期二 08时54分38秒
    > 功能：通过ＴＣＰ将数据发送给客户端
 ************************************************************************/

#ifndef _TCP_H
#define _TCP_H

/*
typedef struct dizhi
{
    int socket_tcp;  //套接字
    socklen_t client_socketlen;  //地址信息的长度
    struct sockaddr_in client_socket;  //地址信息
}IP;
*/

int IP[10];

char data[1024];

int light = 0;

/*************************************************
 *初始化ＴＣＰ的函数
 *
 * **********************************************/
int initTCP(int hton);


/*************************************************
 *给客户端发送心跳包的函数
 *
 * **********************************************/

/*************************************************
 *接收客户端的数据的函数
 *
 * **********************************************/


/*************************************************
 *向客户端发送数据的函数
 *
 *
 * **********************************************/
void *write_TCP(void);


#endif
