/*************************************************************************
	> File Name: ReuseFunction.h
	> Author: 候军军
	> Mail: 15847703113@163.com
	> Created Time: 2018年11月30日 星期五 09时55分04秒
    >简介: 一些会重复使用的功能函数放到这里.
 ************************************************************************/

#ifndef _REUSEFUNCTION_H
#define _REUSEFUNCTION_H

/*************************************************************************
 *温度转换函数
 *功能:将华氏温度转换为摄氏温度
 *参数0:华氏温度的字符串
 *参数1:摄氏温度的字符串
 *返回值:成功返回0
 *       失败返回-1
 * **********************************************************************/
int TemperatureConversionFunction(char *F,char *C);


/*************************************************************************
 *数据放大函数
 *功能:PLC无法处理浮点数据,所以在使用中将浮点数据扩到到相应的整数
 *参数0:要扩大的字符串数据
 *参数1:扩大的倍数
 *参数2:扩大后的字符串
 *返回值:成功返回0
 *       失败返回-1
 * **********************************************************************/
int DataAmplificationFunction(char *data,int multiple,char *BigData);

/*************************************************************************
 * 串口打开函数
 * 参数0:串口标示
 * 参数1:波特率
 * 参数2:数据位
 * 参数3:校验位
 * 参数4:停止位
 * 返回值值:成功返回串口的文件描述符
 *          失败返回-1
 * **********************************************************************/
int open_serial(char *tty,int baud,int datalen,int check,int stop);

/*************************************************************************
 * 串口关闭函数
 * fd : 串口的文件描述符
 * 返回值:无返回值
 * **********************************************************************/
void close_serial(int fd);


/*************************************************************************
 * 读串口
 * fd : 串口的文件流
 * data : 存放读到的数据
 * datalen : 预计读到的数据的字节数
 * 返回值 : 成功返回实际读到的数据的字节数
 *          失败返回-1
 * **********************************************************************/
int read_serial(FILE *fd,char *data,int datalen);



/*************************************************************************
 * 写串口
 * fd : 串口的文件描述符
 * data : 要写的数据
 * datalen : 要写的字节数
 * 返回值: 成功返回0
 *         失败返回-1
 * **********************************************************************/
int write_serial(int fd,char *data,int datalen);


/*************************************************************************
 * 串口可读的监控函数
 * fd : 串口的文件描述符
 * time : 等待时间
 * 返回值 : 文件可读返回文件描述符
 *          失败或超时返回-1
 * **********************************************************************/
int monitoring_serial(int fd,int time);



#endif
