/*************************************************************************
	> File Name: nutriton_delivery_fruit.h
	> Author: HJJ
	> Mail: 15847703113@163.com
	> Created Time: 2018年10月17日 星期三 16时05分35秒
    功能:实现将传感器采集到的数据透传到云服务器上
 ************************************************************************/

#ifndef _DATA_DELYVERY_CLOUD_H
#define _DATA_DELYVERY_CLOUD_H




/*************************************
 *初始化将传感器数据传输给云的功能
 *参数1:云的地址
 *返回值:成功返回0,
         失败返回-1.
 * **********************************/
int init_Data_Delivery_Cloud(char *cloud);


/*************************************
 *执行将传感器数据传输给云
 *参数1:云的地址
 *参数2:要传输的数据
 *返回值:成功返回0,
         失败返回-1.
 * **********************************/
int comply_Data_Delivery_Cloud(char *cloud,char *data);


/*************************************
 *清理函数,当不在调用该模块是使用
 *参数:无
 *返回值:无
 * **********************************/
void exit_Data_Delivery_Cloud(void); 

#endif
