/*************************************************************************
	> File Name: 2475data_collection.h
	> Author: 候军军
	> Mail: 15847703113@163.com
	> Created Time: 2018年12月24日 星期一 11时12分23秒
 ************************************************************************/

#ifndef _2475DATA_COLLECTION_H
#define _2475DATA_COLLECTION_H

/*************************************************************************
 * 初始化串口
 * 参数0:要打开的串口
 * 返回值:成功返回串口的文件流
 *        失败返回NULL
 * **********************************************************************/
FILE 2475data_init(char serial);

/*************************************************************************
 * 读取数据
 * fd : 串口的文件描述符
 * serial_fd : 串口的文件流
 * data : 读到的字符串
 * datalen : 预计要读的字节数
 * 返回值:成功返回读到的字节数
 *        失败返回-1
 * **********************************************************************/
int 2475data_read(int fd,FILE *serial_fd,char *data,int datalen);


/*************************************************************************
 * 提取数据
 * 参数0:待处理的数据,
 * 参数1:处理好的数据
 * 返回值:成功返回0,
 *        失败返回-1
 * **********************************************************************/
int extract_data(char *data,char **datako);

/*************************************************************************
 * 整理数据
 * 参数0:处理好的数据
 * 返回值:成功返回整理好的字符串
 *        失败返回NULL;
 * **********************************************************************/
char *organize_data(char **datako);





#endif
