/*************************************************************************
	> File Name: Spectrum_Data_Process.c
	> Author: 候军军
	> Mail: 15847703113@163.com
	> Created Time: 2019年06月20日 星期四 22时16分53秒
 ************************************************************************/

#include<stdio.h>

#include"Log.h"
#include"Spectrum_Data_Process.h"

/*数据校验模块
 * 参数:原始数据
 * 返回值:成功返回0
 *        失败返回-1*/


/*数据拆分模块
 * 参数1:原始数据
 * 参数2:拆分的符号
 * 参数3:
 * 返回值:成功返回拆分后的字符串
 *        失败返回NULL*/


/*数据类型判断函数
 * 参数:频谱的数据类型
 * 返回值:我们自己定义的数据类型*/



/*频谱设备数据处理函数
 * 参数1:原始数据
 * 参数2:返回的处理后的数据
 * 返回值:成功返回处理后的字符的个数
 *        失败返回-1*/
int Spectrum_Data_Process(char *data,char **element)
{
    //对数据进行校验
    //对数据进行拆分
    //对数据进行提取
}



